wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
#ifdef AMP01

#include "AMP01.H"

#include "string.h"				//串和内存操作函数头文件
//#include "stm32f10x_dma.h"

#include	"AMP_PHY.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"

#include "SWITCHID.H"

#include 	"CRC.H"




RS485Def stRS485Ly;   //usart2,pa1    //层板接口
RS485Def stRS485Cb;   //uart4,pc12    //副柜接口
SwitchDef stSwitch;

unsigned  char addr2,addr3; //地址
stSysdef  AMP;

unsigned  short testcrc = 0;
unsigned char tetbff[] = { 0x7E,0x07,0x02,0x02,0x01,0x01,0x01,0x01,0x01,0x00,0xA1,0x7F };
unsigned  long*  MCUMEMaddr = (unsigned  long*)(0x1FFFF7E0);
unsigned  short  MCUMEMsize  = 0;
unsigned  short seril=0;
unsigned  char  ackupfarme[]=
{
  0x7E,
  0x02,
  0x81,
  0x00,
  0xB0,
  0x50,
  0x7F
};
unsigned  char  ackdownfarme[]=
{
  0x7E,
  0x02,
  0x01,
  0x00,
  0xD1,
  0x90,
  0x7F
};
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01_Configuration(void)
{	
  MCUMEMsize  = *MCUMEMaddr;
  testcrc = CRC16_MODBUS(&tetbff[1],8);
  if(0x0100 ==  MCUMEMsize) //256K Flash 柜控制板STM32F103RC
  {
    AMP.Flag.CabBD  = 1;
    AMP.Flag.LayBD  = 0;
    AMP.Flag.SetBD  = 0;
  }
  else if(0x0080 ==  MCUMEMsize) //128K Flash 层控制板STM32F103CB
  {
    AMP.Flag.CabBD  = 0;
    AMP.Flag.LayBD  = 1;
    AMP.Flag.SetBD  = 1;
  }
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	 
	
  IWDG_Configuration(1000);													//独立看门狗配置---参数单位ms
  
  SysTick_Configuration(1000);    //系统嘀嗒时钟配置72MHz,单位为uS
  
  SwitchID_Configuration();
  
  GenyConfiguration();   //常规接口配置，背光，锁，电源控制
    
  COMM_Configuration();  
	
	if(AMP.Flag.CabBD)
	{
		if(AMP.SwData.ID)		//已拨码
			PWM_OUT(TIM2,PWM_OUTChannel1,1,900);						//PWM设定-20161127版本
		else
			PWM_OUT(TIM2,PWM_OUTChannel1,5,900);						//PWM设定-20161127版本
	}
	else
		GPIO_Configuration_OPP50(SYSLEDPort,SYSLEDPin);

  while(1)
  {
    AMP01_Loop();
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01_Server(void)
{  
	IWDG_Feed();								//独立看门狗喂狗
	
  SwitchID_Server();
  RequestServer();
  StatusServer();
  Tim_Server();
}
/*******************************************************************************
*函数名			:	MainBoard_Server
*功能描述		:	主柜空闲服务程序
              1-查询在线设备
              2-查询副柜有无数据上传
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMP01_Loop(void)
{
    if(AMP.Flag.CabBD)  //柜控制板
    {
			if(0  ==  AMP.SwData.ID)		//未拨码
			{
				if(AMP.Time.SYSLEDTime>=500)
				{
					GPIO_Toggle	(BackLightPort,BackLightPin);		//将GPIO相应管脚输出翻转----V20170605
					AMP.Time.SYSLEDTime  = 0;
				}
				return;
			}
    }
    else if(AMP.Flag.LayBD)
    {
				if(AMP.Time.SYSLEDTime%500==0)
				{
					GPIO_Toggle	(SYSLEDPort,SYSLEDPin);		//将GPIO相应管脚输出翻转----V20170605
				}				
    }

  Receive_Server();
  Send_Server();
}

//=================================软件接口ST=============================================================
/*******************************************************************************
*函数名			:	MainBoard_Server
*功能描述		:	主柜空闲服务程序
              1-查询在线设备
              2-查询副柜有无数据上传
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void MainCabinet_IDLEServer(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Send_Server(void)
{
  if(AMP.Flag.CabBD)//柜控制板
  {
    //----------------PC发送
    if(0  ==  AMP.Time.PcSendTime)
    {
      Check_SendBuff(PcPort);
    }
    //----------------柜发送
    if(0  ==  AMP.Time.CabSendTime)
    {
      Check_SendBuff(CabPort);
    }
    //----------------层发送
    if(0  ==  AMP.Time.LaySendTime)
    {
      Check_SendBuff(LayPort);
    }
    //----------------读卡器发送
    if(0  ==  AMP.Time.CardSendTime)
    {
      Check_SendBuff(CardPort);
    }
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    //----------------层发送
    if(0  ==  AMP.Time.LaySendTime)
    {
      Check_SendBuff(LayPort);
    }
  }
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Check_SendBuff(enCCPortDef Port)
{ 
  unsigned  char  i  = 0;
  unsigned  short  SendLen  = 0;
  unsigned  char  ackflag =0;
  unsigned  char  ackdir =0;
  unsigned  char* SendAddr = NULL;  
  unsigned  char*  ReSendCount;      //PC上传重发计数
  
  unsigned  short*  SendTime=NULL;
  
  stTxdef* Txd  = NULL;
  
  if(LayPort  ==  Port) //层板：需要检查供电有无打开
  {
    if(0  ==  AMP.Flag.LayPownOn) //供电未打开
    {
      return  0;
    }
  }
  
  //------------------------------检查重发
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : ReSendCount = &AMP.ReSend.PcCount;
                      Txd=AMP.buffer.PcTx;    //PC接口发送缓存
                      SendTime  = &AMP.Time.PcSendTime;
                      ackflag = AMP.AckQ.PcAck;
                      ackdir  = AMP.AckQ.PcDir;
      break;
    case  CabPort   : ReSendCount = &AMP.ReSend.CabCount;
                      Txd=AMP.buffer.CabTx;   //柜接口发送缓存
                      SendTime  = &AMP.Time.CabSendTime;
                      ackflag = AMP.AckQ.CabAck;
                      ackdir  = AMP.AckQ.CabDir;
      break;
    case  LayPort   : ReSendCount = &AMP.ReSend.LayCount;
                      Txd=AMP.buffer.LayTx;   //层接口发送缓存
                      SendTime  = &AMP.Time.LaySendTime;
                      ackflag = AMP.AckQ.LayAck;
                      ackdir  = AMP.AckQ.LayDir;
      break;
    case  CardPort  : ReSendCount = &AMP.ReSend.CardCount;
                      Txd=AMP.buffer.CardTx;  //读卡器接口发送缓存
                      SendTime  = &AMP.Time.CardSendTime;
                      ackflag = 0;
      break;
    default :return 0;      //不继续执行 
  }
  if(ackflag) //有应答请求，先应答
  {
    if(ackdir)  //向上应答
      SendLen = HW_SendBuff(Port,ackupfarme,sizeof(ackupfarme));   //返回已发送字节
    else
      SendLen = HW_SendBuff(Port,ackdownfarme,sizeof(ackdownfarme));   //返回已发送字节
    if(SendLen)   //应答发送成功---清除标志请求
    {
      switch(Port)
      {
        case  NonPort   : return 0;   //不继续执行
        case  PcPort    : AMP.AckQ.PcAck = 0;
          break;
        case  CabPort   : AMP.AckQ.CabAck = 0;
          break;
        case  LayPort   : AMP.AckQ.LayAck = 0;
          break;
        case  CardPort  : AMP.AckQ.CardAck  = 0;
          break;
        default :return 0;      //不继续执行 
      }
    }
    *SendTime  = 10;
    return  0;
  }
  if(*SendTime>0)   //不到重发时间，退出
  {
    return  0;
  }
  
  //------------------------------检查发送缓存:先发送排序为1的缓存
  for(i=0;i<arrysize;i++)
  {
    if(1  ==  Txd[i].arry)
    {
      SendAddr  = Txd[i].data;    //起始地址
      SendLen   = Txd[i].size;    //大小
    }
  }
  //-----------------------------有发数据 
  if(NULL!= SendAddr)
  {
    SendLen = HW_SendBuff(Port,SendAddr,SendLen);   //返回已发送字节
    if(SendLen)   //成功发送到缓存
    {
      *ReSendCount +=1;
      *SendTime = ReSendWaitTime;
      
      if(*ReSendCount>=maxresendcount) //超出重发次数：放弃发送
      {
        Releas_OneBuffer(Port);
        *ReSendCount  = 0;      //重发清零
      }
    }
    else
    {
      *SendTime = ReSendWaitTime;
    }
    return  SendLen;
  }
  return  0;
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_Process(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{ 
 if(AMP.Flag.CabBD) //柜控制板  
  Msg_ProcessCB(Port,pBuffer,length);       //柜消息处理
 else
  Msg_ProcessLY(Port,pBuffer,length);      //层消息处理
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessCB(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  switch(Port)
  {
        case PcPort:Msg_ProcessPcPort(Port,pBuffer,length);     //PC端口
          break;
        case CabPort:Msg_ProcessCbPort(Port,pBuffer,length);    //柜端口
          break;
        case LayPort:Msg_ProcessLyPort(Port,pBuffer,length);    //层端口
          break;
        case CardPort:Msg_ProcessCaPort(Port,pBuffer,length);   //读卡器端口
          break;
        default:
          break;
  }
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessPcPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0; 
  unsigned  char  Cmd         = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  
  //-------------------------协议检查
  framlength	=	getframe(pBuffer,&length);    //判断帧消息内容是否符合协议
  if(0== framlength)
  {
    memset(paddrbac,0x00,gDatasize);             //清除数据
    return;
  }
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1  
  if(1==result)
  {
    if(AMP.Flag.WaitAck)      //如果为等待应答状态，则释放一个缓存
    {
      AMP.Flag.WaitAck=0;
      Releas_OneBuffer(Port);        //释放一个发送缓存
    }
    return;
  }  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd.cmd;  
  
  //-------------------------上传数据:柜接口
  //主柜：接收到的数据上传到PC并向下应答
  //副柜：接收到下发数据判断地址,如果地址为本地址，向上应答(广播地址不应答)，如果是上传数据，不处理
  //1）-----------------上传数据:主柜接收到的数据上传到PC，并向下应答，副柜不处理
  if(1==ampframe->msg.cmd.dir)
  {
    if(1==AMP.SwData.MainFlg)
    {
      ackFrame(Port,0);   //向下应答
      PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
      return;
    }    
    else
      return;
  }
  //2）-----------------下发数据：地址为本地址或者广播地址(0xFF)需要进行处理，如果地址为本地址，向上应答(广播地址不应答)
  address=ampframe->msg.addr.address1;
  if(0==address)  //柜地址为空
  {
    return;
  }
  if((AMP.SwData.ID!=address))  //不属于主柜消息
  {
    Cabinet_Send((unsigned char*)ampframe,framlength);//往副柜发送
    if(0xFF==address) //广播地址
    {
      AMP.Flag.WaitAck=0;   //不需要副柜应答      
    }
    else
    {
      AMP.Flag.WaitAck=1;   //需要副柜应答
      return;
    }
  }
  //===================================柜接口接收到的下发数据处理
  if(0xFF!=address)   //非广播地址，向上应答
  {
    ackFrame(Port,1); //向上应答
  }
  //1)-----------------检查层地址，判断是否需要将数据发往层，发往层时，需要开锁，开背光灯
  address=ampframe->msg.addr.address2;
  if(0!=address)
  {
    AMP.Req.unlockqust=1;//请求开锁
    AMP.Req.reslock=0;
    AMP.Req.BLon=1;
    AMP.Req.BLoff=0;
    AMP.Req.PLon=1; 
    AMP.Req.PLoff=0; 
    AMP.Flag.WaitAck=1;   //需要应答
    Laynet_Send((unsigned char*)ampframe,framlength);     //往层板发送消息
  }
  //2)-----------------命令处理：灯控制/锁控制/供电
  if(LED ==  Cmd)   //背光控制命令
  {
    AMP.Req.BLon=0;
    AMP.Req.BLoff=0;
    if(ampframe->msg.data[0])
      AMP.Req.BLon=1;
    else
      AMP.Req.BLoff=1;
  }
  else if(PWD ==  Cmd)   //层板供电控制命令
  {
    AMP.Req.PLon  =0;
    AMP.Req.PLoff =0;
    if(ampframe->msg.data[0])
      AMP.Req.PLon=1;
    else
      AMP.Req.PLoff=1;
  }
  else if(CTL ==  Cmd)   //锁控制命令
  {
    AMP.Req.reslock  =0;
    AMP.Req.unlockqust =0;
    if(ampframe->msg.data[0])
      AMP.Req.unlockqust=1;
    else
      AMP.Req.reslock=1;
  }
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessCbPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0; 
  unsigned  char  Cmd         = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  
  //-------------------------协议检查
  framlength	=	getframe(pBuffer,&length);    //判断帧消息内容是否符合协议
  if(0== framlength)
  {
    memset(paddrbac,0x00,gDatasize);             //清除数据
    return;
  }
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1  
  if(1==result)
  {
    if(AMP.Flag.WaitAck)      //如果为等待应答状态，则释放一个缓存
    {
      AMP.Flag.WaitAck=0;
      Releas_OneBuffer(Port);        //释放一个发送缓存
    }
    return;
  }  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd.cmd;  
  
  //-------------------------上传数据:柜接口
  //主柜：接收到的数据上传到PC并向下应答
  //副柜：接收到下发数据判断地址,如果地址为本地址，向上应答(广播地址不应答)，如果是上传数据，不处理
  //1）-----------------上传数据:主柜接收到的数据上传到PC，并向下应答，副柜不处理
  if(1==ampframe->msg.cmd.dir)
  {
    if(1==AMP.SwData.MainFlg)
    {
      ackFrame(Port,0);   //向下应答
      PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
      return;
    }    
    else
      return;
  }
  //2）-----------------下发数据：地址为本地址或者广播地址(0xFF)需要进行处理，如果地址为本地址，向上应答(广播地址不应答)
  address=ampframe->msg.addr.address1;
  if((0xFF!=address)&&(AMP.SwData.ID!=address))
  {
    return;   //地址不对，不处理
  }
  //===================================柜接口接收到的下发数据处理
  if(0xFF!=address)   //非广播地址，向上应答
  {
    ackFrame(Port,1); //向上应答
  }
  //1)-----------------检查层地址，判断是否需要将数据发往层，发往层时，需要开锁，开背光灯
  address=ampframe->msg.addr.address2;
  if(0!=address)
  {
    AMP.Req.unlockqust=1;//请求开锁
    AMP.Req.reslock=0;
    AMP.Req.BLon=1;
    AMP.Req.BLoff=0;
    AMP.Req.PLon=1; 
    AMP.Req.PLoff=0;    
    Laynet_Send((unsigned char*)ampframe,framlength);     //往层板发送消息
  }
  //2)-----------------命令处理：灯控制/锁控制/供电
  if(LED ==  Cmd)   //背光控制命令
  {
    AMP.Req.BLon=0;
    AMP.Req.BLoff=0;
    if(ampframe->msg.data[0])
      AMP.Req.BLon=1;
    else
      AMP.Req.BLoff=1;
  }
  else if(PWD ==  Cmd)   //层板供电控制命令
  {
    AMP.Req.PLon  =0;
    AMP.Req.PLoff =0;
    if(ampframe->msg.data[0])
      AMP.Req.PLon=1;
    else
      AMP.Req.PLoff=1;
  }
  else if(CTL ==  Cmd)   //锁控制命令
  {
    AMP.Req.reslock  =0;
    AMP.Req.unlockqust =0;
    if(ampframe->msg.data[0])
      AMP.Req.unlockqust=1;
    else
      AMP.Req.reslock=1;
  }
  //CMD_Process(pBuffer,framlength);
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessCaPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  stcmddef    Cmd;
  //-------------------------读卡器端口:读卡器接口接收的数据只通过柜接口或者PC接口上传
  if(CardPort  == Port)   //读卡器接口无协议，只打包数据透传
  {
    unsigned  char  databuffer[64]={0};   
    //-------------------------读卡器端口接收到数据
    memcpy(databuffer,pBuffer,length);
    framlength  = length;
    framlength  = PaketUpMsg(databuffer,ICR,&framlength);
    //-------------------------设置地址:柜控制板地址段为address1
    ampframe  = (stampphydef*)databuffer;
    ampframe->msg.addr.address1 = AMP.SwData.ID;
    ampframe->msg.addr.address2 = 0;
    ampframe->msg.addr.address3 = 0;
    //-------------------------设置CRC和结束符
    SetCrc(databuffer,&framlength);
    //-------------------------检查本柜是否为主柜
    if(1==AMP.SwData.MainFlg)   //主柜--通过PC接口上传
    {
      PCnet_Send(databuffer,framlength);
    }
    else  //副柜--通过副柜接口上传
    {
      //PCnet_Send(databuffer,framlength);
      Cabinet_Send(databuffer,framlength);     //往副柜发送消息
    }
    return;
  }
  //-------------------------协议检查
  framlength	=	getframe(pBuffer,&length);    //判断帧消息内容是否符合协议
  if(0== framlength)
  {
    memset(paddrbac,0x00,gDatasize);             //清除数据
    return;
  }
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1  
  if(1==result)
  {
    Releas_OneBuffer(Port);        //释放一个发送缓存
    return;
  }
  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd;
  
  
