wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
  //-------------------------下发数据
  if(0  ==  Cmd.dir)
  {    
    if(PcPort == Port)
    {
      ackFrame(Port,1); //向上应答
      if(AMP.SwData.ID  ==  ampframe->msg.addr.address1)    //柜地址
      {
        goto CabinetSelfDownDataProcess;
      }
      else if(0xFF  ==  ampframe->msg.addr.address1)      //广播地址--对所有柜
      {
        Cabinet_Send((unsigned char*)ampframe,framlength);           //往副柜发送消息
        goto CabinetSelfDownDataProcess;
      }
      else
      {
        Cabinet_Send((unsigned char*)ampframe,framlength);           //往副柜发送消息
        return;
      }
    }
    else if(CabPort == Port)    //柜接口接收到下发数据要做地址判断
    {
      if(AMP.SwData.ID  ==  ampframe->msg.addr.address1)
      {
        ackFrame(CabPort,1); //向上应答
        //goto CabinetSelfDownDataProcess;
      }
      else if(0xFF  ==  ampframe->msg.addr.address1)  //广播数据
      {
        //goto CabinetSelfDownDataProcess;
      }
      else    //其它柜数据：退出，不处理
      {
        return;
      }
      goto CabinetSelfDownDataProcess;
    }
    else if(LayPort == Port)  //层控制接口无下发数据，只有上传数据
    {
      //CMD_Process((unsigned char*)ampframe,framlength);
      return;
    }    
  }
  //-------------------------上传数据
  else
  {    
    if(PcPort == Port)    //PC口只下发消息
    {
      return;
    }
    else if(CabPort == Port)  //柜接口接收到数据，如果为主机，则应答，再上传到PC端口，如果是副柜，上传到PC端口，不应答
    {
      if(AMP.SwData.MainFlg)  //主柜接收到上柜端口数据需要应答
      {
        ackFrame(Port,0);   //向下应答
      }
      PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
      return;
    }
    else if(LayPort == Port)
    {
      ackFrame(Port,0);   //向下应答
      goto CabinetSelfUpDataProcess;
    }
  }
  
  return;
  
  //----------------------下发消息需要本柜处理时会执行此过程
  CabinetSelfDownDataProcess:     //本柜接收到的上级下发消息处理：根据第二级地址确定是否需要转发
  
  //---------------------检查此消息是否需要转发到层
  if(0x00 != ampframe->msg.addr.address2)   //层地址不为0表示需要转发
  {
    Laynet_Send((unsigned char*)ampframe,framlength);     //往层板发送消息
    CMD_Process(pBuffer,framlength);
  }
  //---------------------不需要转发，消息内容针对柜控制板
  else
  {
    CMD_Process(pBuffer,framlength);
  }
  return;
  
  //----------------------上报类型的消息address1为0时会执行此过程
  CabinetSelfUpDataProcess:     //接收到层上报的消息：需要添加柜地址，如果本柜为主柜，则上传到PC，如果为副柜，则上传到主柜
  //----------------------补充数据
  ampframe->msg.addr.address1 = AMP.SwData.ID;    //添加ID
  ampframe->msg.cmd.dir       = 1;                //传输方向设定为上传模式
  SetCrc((unsigned char*)ampframe,&framlength);   //重新计算CRC
  //----------------------根据是否为主柜选择消息传输接口
  if(AMP.SwData.MainFlg)        //主柜：通过PC接口上传
  {
    PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
  }
  else    //辅柜：上传到PC端口和副柜接口
  {
    PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
    Cabinet_Send((unsigned char*)ampframe,framlength);  //通过柜接口向主柜发送消息
  }
  return;
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessLyPort(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  stcmddef    Cmd;
  //-------------------------读卡器端口:读卡器接口接收的数据只通过柜接口或者PC接口上传
  if(CardPort  == Port)   //读卡器接口无协议，只打包数据透传
  {
    unsigned  char  databuffer[64]={0};   
    //-------------------------读卡器端口接收到数据
    memcpy(databuffer,pBuffer,length);
    framlength  = length;
    framlength  = PaketUpMsg(databuffer,ICR,&framlength);
    //-------------------------设置地址:柜控制板地址段为address1
    ampframe  = (stampphydef*)databuffer;
    ampframe->msg.addr.address1 = AMP.SwData.ID;
    ampframe->msg.addr.address2 = 0;
    ampframe->msg.addr.address3 = 0;
    //-------------------------设置CRC和结束符
    SetCrc(databuffer,&framlength);
    //-------------------------检查本柜是否为主柜
    if(1==AMP.SwData.MainFlg)   //主柜--通过PC接口上传
    {
      PCnet_Send(databuffer,framlength);
    }
    else  //副柜--通过副柜接口上传
    {
      //PCnet_Send(databuffer,framlength);
      Cabinet_Send(databuffer,framlength);     //往副柜发送消息
    }
    return;
  }
  //-------------------------协议检查
  framlength	=	getframe(pBuffer,&length);    //判断帧消息内容是否符合协议
  if(0== framlength)
  {
    memset(paddrbac,0x00,gDatasize);             //清除数据
    return;
  }
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1  
  if(1==result)
  {
    Releas_OneBuffer(Port);        //释放一个发送缓存
    return;
  }
  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd;
  
  
  //-------------------------下发数据
  if(0  ==  Cmd.dir)
  {    
    if(PcPort == Port)
    {
      ackFrame(Port,1); //向上应答
      if(AMP.SwData.ID  ==  ampframe->msg.addr.address1)    //柜地址
      {
        goto CabinetSelfDownDataProcess;
      }
      else if(0xFF  ==  ampframe->msg.addr.address1)      //广播地址--对所有柜
      {
        Cabinet_Send((unsigned char*)ampframe,framlength);           //往副柜发送消息
        goto CabinetSelfDownDataProcess;
      }
      else
      {
        Cabinet_Send((unsigned char*)ampframe,framlength);           //往副柜发送消息
        return;
      }
    }
    else if(CabPort == Port)    //柜接口接收到下发数据要做地址判断
    {
      if(AMP.SwData.ID  ==  ampframe->msg.addr.address1)
      {
        ackFrame(CabPort,1); //向上应答
        //goto CabinetSelfDownDataProcess;
      }
      else if(0xFF  ==  ampframe->msg.addr.address1)  //广播数据
      {
        //goto CabinetSelfDownDataProcess;
      }
      else    //其它柜数据：退出，不处理
      {
        return;
      }
      goto CabinetSelfDownDataProcess;
    }
    else if(LayPort == Port)  //层控制接口无下发数据，只有上传数据
    {
      //CMD_Process((unsigned char*)ampframe,framlength);
      return;
    }    
  }
  //-------------------------上传数据
  else
  {    
    if(PcPort == Port)    //PC口只下发消息
    {
      return;
    }
    else if(CabPort == Port)  //柜接口接收到数据，如果为主机，则应答，再上传到PC端口，如果是副柜，上传到PC端口，不应答
    {
      if(AMP.SwData.MainFlg)  //主柜接收到上柜端口数据需要应答
      {
        ackFrame(Port,0);   //向下应答
      }
      PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
      return;
    }
    else if(LayPort == Port)
    {
      ackFrame(Port,0);   //向下应答
      goto CabinetSelfUpDataProcess;
    }
  }
  
  return;
  
  //----------------------下发消息需要本柜处理时会执行此过程
  CabinetSelfDownDataProcess:     //本柜接收到的上级下发消息处理：根据第二级地址确定是否需要转发
  
  //---------------------检查此消息是否需要转发到层
  if(0x00 != ampframe->msg.addr.address2)   //层地址不为0表示需要转发
  {
    Laynet_Send((unsigned char*)ampframe,framlength);     //往层板发送消息
    CMD_Process(pBuffer,framlength);
  }
  //---------------------不需要转发，消息内容针对柜控制板
  else
  {
    CMD_Process(pBuffer,framlength);
  }
  return;
  
