wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
  //----------------------上报类型的消息address1为0时会执行此过程
  CabinetSelfUpDataProcess:     //接收到层上报的消息：需要添加柜地址，如果本柜为主柜，则上传到PC，如果为副柜，则上传到主柜
  //----------------------补充数据
  ampframe->msg.addr.address1 = AMP.SwData.ID;    //添加ID
  ampframe->msg.cmd.dir       = 1;                //传输方向设定为上传模式
  SetCrc((unsigned char*)ampframe,&framlength);   //重新计算CRC
  //----------------------根据是否为主柜选择消息传输接口
  if(AMP.SwData.MainFlg)        //主柜：通过PC接口上传
  {
    PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
  }
  else    //辅柜：上传到PC端口和副柜接口
  {
    PCnet_Send((unsigned char*)ampframe,framlength);     //往PC发送消息
    Cabinet_Send((unsigned char*)ampframe,framlength);  //通过柜接口向主柜发送消息
  }
  return;
}
/*******************************************************************************
* 函数名			:	Cabinetmsg_Process
* 功能描述		:	柜消息处理：处理上位机下发消息，处理主柜下发消息，处理层板消息 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void Msg_ProcessLY(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{  
  unsigned  char result       = 0; 
  unsigned  char address      = 0;  
  unsigned  short framlength  = 0;  
  unsigned  char* paddrbac    = pBuffer;         //备份数据缓存起始地址
  
  stampphydef* ampframe=NULL;
  stcmddef    Cmd;
  //-------------------------如果此不为层控制板，不执行以下步骤
  if(0==AMP.Flag.LayBD)//层控制板
  {
    return;
  }
  //-------------------------检查端口是否为层接口及缓存地址是否为空
  if(LayPort!=Port||NULL==pBuffer)
  {
    return;
  }
  //-------------------------协议检查
  framlength	=	getframe(pBuffer,&length);    //判断帧消息内容是否符合协议
  if(0== framlength)
  {
    memset(paddrbac,0x00,gDatasize);             //清除数据
    return;
  }
  //-------------------------检查是否为应答帧
  result  = ackcheck(pBuffer);                //检查是否为应答消息,应答消息返回1
  if(1==result)
  {
    Releas_OneBuffer(Port);        //释放一个发送缓存
    return;
  }
  //-------------------------地址检查

  if(0==addr2check(pBuffer,addr2))
    return;
  if(0==addr3check(pBuffer,addr3))
    return;

  
  //-------------------------根据地址转发数据：广播数据发送到副柜和本柜层板
  ampframe  = (stampphydef*)pBuffer;
  Cmd = ampframe->msg.cmd;
  
  //-------------------------下发数据
  if(0  ==  Cmd.dir)
  {
    CMD_Process((unsigned char*)ampframe,framlength);
  }
  //-------------------------上传数据
  else
  {    
    return;   //层板端口只接收下发数据，如有上发数据，则为其它层上传，其它层板不处理
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void CMD_Process(unsigned char* pBuffer,unsigned short length)
{
  unsigned  short datalen     = 0; 
  stampphydef* ampframe       = NULL;
  eucmddef*    cmd  = NULL;
  
  ampframe  = (stampphydef*)pBuffer;
  cmd = (eucmddef*)&ampframe->msg.cmd;
  //---------------------------上位机下发读卡器命令
  if(ICR ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    datalen = ampframe->msg.length-4;   //减一命令位，三地址位长度
    CardPort_Send(ampframe->msg.data,datalen);   //往读卡器接口发数据
    return;
  }
  //---------------------------开锁命令
  if(CTL ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    if(0  ==  ampframe->msg.data[0])    //0为开锁命令
    {
//      UnLock;   //开锁
      AMP.Req.unlockqust = 1;
      AMP.Req.reslock    = 0;
    }
    else
    {
//      ResLock;  //释放锁
      AMP.Req.unlockqust = 0;
      AMP.Req.reslock    = 1;      
    }
    return;
  }
  //---------------------------层板供电控制
  if(PWD ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    if(0==AMP.Flag.CabBD)  //柜控制板
      return;
    if(0  ==  ampframe->msg.data[0])    //0为开锁命令
    {       
      LayPowerOff;//关闭层板供电
    }
    else
    {
      LayPowerOn;//打开层板供电
    }
    return;
  }
  //---------------------------开背光灯命令
  if(LED ==  (*cmd&Down)) //最高位为0表示上往下发
  {
    if(AMP.Flag.CabBD)  //柜控制板
    {
      if(0==ampframe->msg.addr.address2)
       {
        if(0  !=  ampframe->msg.data[0])    //1为开LED
        {
          BackLightOn;   //开LED
        }
        else
        {
          BackLightOff;  //关LED
        }
      }
      return;
    }
    else if(AMP.Flag.LayBD) //层控制板
    {
      PWM_OUT(TIM2,PWM_OUTChannel2,2,1000);						//PWM设定-20161127版本---红色
      PWM_OUT(TIM2,PWM_OUTChannel4,2,1000);						//PWM设定-20161127版本---黄色
      PWM_OUT(TIM2,PWM_OUTChannel3,2,1000);						//PWM设定-20161127版本---蓝色
      
      if(ampframe->msg.data[0]) //红灯
        PWM_OUT(TIM2,PWM_OUTChannel2,2,500);						//PWM设定-20161127版本---红色
      if(ampframe->msg.data[1]) //黄色
        PWM_OUT(TIM2,PWM_OUTChannel4,2,500);						//PWM设定-20161127版本---黄色
      if(ampframe->msg.data[2]) //蓝色
        PWM_OUT(TIM2,PWM_OUTChannel3,2,500);						//PWM设定-20161127版本---蓝色
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	dir:0向下应答，1向上应答
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ackFrame(enCCPortDef Port,unsigned char dir)
{
  switch(Port)
  {
    case  NonPort   : return;   //不继续执行
    case  PcPort    : AMP.AckQ.PcAck  = 1;
                      AMP.AckQ.PcDir  = dir;
      break;
    case  CabPort   : AMP.AckQ.CabAck  = 1;
                      AMP.AckQ.CabDir  = dir;
      break;
    case  LayPort   : AMP.AckQ.LayAck  = 1;
                      AMP.AckQ.LayDir  = dir;
      break;
    //case  CardPort  : AMP.AckQ.CardAck  = 1;
    //                    AMP.AckQ.CardDir  = dir;
      //break;
    default :return;      //不继续执行 
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Releas_OneBuffer(enCCPortDef Port)
{
  unsigned  char  i  = 0;
  stTxdef* Txd  = NULL;
  unsigned  char*  ReSendCount;      //PC上传重发计数
  unsigned  short*  SendTime=NULL;
  
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : ReSendCount = &AMP.ReSend.PcCount;
                      Txd=AMP.buffer.PcTx;    //PC接口发送缓存
                      SendTime  = &AMP.Time.PcSendTime;
      break;
    case  CabPort   : ReSendCount = &AMP.ReSend.CabCount;
                      Txd=AMP.buffer.CabTx;   //柜接口发送缓存
                      SendTime  = &AMP.Time.CabSendTime;
      break;
    case  LayPort   : ReSendCount = &AMP.ReSend.LayCount;
                      Txd=AMP.buffer.LayTx;   //层接口发送缓存
                      SendTime  = &AMP.Time.LaySendTime;
      break;
    case  CardPort  : ReSendCount = &AMP.ReSend.CardCount;
                      Txd=AMP.buffer.CardTx;  //读卡器接口发送缓存
                      SendTime  = &AMP.Time.CardSendTime;
      break;
    default :return 0;      //不继续执行 
  }
  for(i=0;i<arrysize;i++)
  {
    if(Txd[i].arry>0)
    {
      Txd[i].arry--;
      *SendTime  = SendNopTime;   //释放一个缓存后等待SendNopTime时间后再发下一帧
      *ReSendCount  = 0;
    }
  }
  return  0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	AddSendData
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short AddSendBuffer(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{
  unsigned  char  i  = 0;
  unsigned  char  lastarry  = 0;
  
