wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
  stTxdef* Txd  = NULL;
  
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : Txd=AMP.buffer.PcTx;    //PC接口发送缓存
      break;
    case  CabPort   : Txd=AMP.buffer.CabTx;   //柜接口发送缓存
      break;
    case  LayPort   : Txd=AMP.buffer.LayTx;   //层接口发送缓存
      break;
    case  CardPort  : Txd=AMP.buffer.CardTx;  //读卡器接口发送缓存
      break;
    default :return 0;      //不继续执行 
  }
  //-------------------------给当前待发送队列编号(最尾号)
  for(i=0;i<arrysize;i++)
  {
    if(Txd[i].arry>lastarry)
    {
      lastarry  = Txd[i].arry;
      //---------------------检查发送队列中是否有相同的指令，如果有，则退出
      if(0  ==  memcmp(Txd[i].data,pBuffer,length)) //比较相同
      {
        if(length ==  Txd[i].size)    //待发送长度一样
          return  length;
      }
    }
  }
  if(lastarry>=arrysize)  //缓存满
    return 0;     //不继续执行
  lastarry=lastarry+1;      //最后的队列编号
  //-------------------------将数据存储到空队列
  for(i=0;i<arrysize;i++)
  {
    if(0  ==  Txd[i].arry)  //0编号表示此为空缓存
    {
      memcpy(Txd[i].data,pBuffer,length);
      Txd[i].arry = lastarry;             //此缓存在发送队列中的排序
      Txd[i].size = length; 
      return  length;
    }
  }
  return  0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往PC发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short PCnet_Send(unsigned char* pBuffer,unsigned short length)
{
  return(AddSendBuffer(PcPort,pBuffer,length));
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往副柜发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Cabinet_Send(unsigned char* pBuffer,unsigned short length)
{
  return(AddSendBuffer(CabPort,pBuffer,length));
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往层板发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short Laynet_Send(unsigned char* pBuffer,unsigned short length)
{
  if(AMP.Flag.CabBD)  //柜控制板
  {
    return(AddSendBuffer(LayPort,pBuffer,length));
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    return(AddSendBuffer(LayPort,pBuffer,length));
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	往读卡器接口发送消息
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short CardPort_Send(unsigned char* pBuffer,unsigned short length)
{
  return(AddSendBuffer(CardPort,pBuffer,length));
}
//=================================软件接口End=============================================================


//=================================硬件接口ST==============================================================
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Receive_Server(void)
{
  unsigned short RxNum  = 0;
  unsigned char rxd[256]={0};
  //==========================================================接收查询
  if(AMP.Flag.CabBD)  //柜控制板
  {
    //---------------------PC接口 USART1
    RxNum = USART_ReadBufferIDLE(USART1,rxd);
    if(RxNum)
    {
      Msg_Process(PcPort,rxd,RxNum);                //柜消息处理
    }
    //---------------------副柜接口 UART4
    RxNum = RS485_ReadBufferIDLE(&stRS485Cb,rxd);
    if(RxNum)
    {
      Msg_Process(CabPort,rxd,RxNum);
    }  
    //---------------------层板接口 USART2
    RxNum = RS485_ReadBufferIDLE(&stRS485Ly,rxd);
    if(RxNum)
    {
      Msg_Process(LayPort,rxd,RxNum);              //柜消息处理
    }
    //---------------------读卡器接口 USART3
    RxNum = USART_ReadBufferIDLE(USART3,rxd);
    if(RxNum)
    {
      Msg_Process(CardPort,rxd,RxNum);
    }
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    //---------------------层板接口 USART2
    RxNum = RS485_ReadBufferIDLE(&stRS485Ly,rxd);
    if(RxNum)
    {
      Msg_Process(LayPort,rxd,RxNum);              //柜消息处理
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short HW_SendBuff(enCCPortDef Port,unsigned char* pBuffer,unsigned short length)
{ 
  unsigned  short   sendedlen = 0;
  switch(Port)
  {
    case  NonPort   : return 0;   //不继续执行
    case  PcPort    : sendedlen = USART_DMASend(USART1,pBuffer,length);
      break;
    case  CabPort   : sendedlen = RS485_DMASend(&stRS485Cb,pBuffer,length);	//RS485-DMA发送程序
      break;
    case  LayPort   : sendedlen = RS485_DMASend(&stRS485Ly,pBuffer,length);	//RS485-DMA发送程序
      break;
    case  CardPort  : sendedlen = USART_DMASend(USART3,pBuffer,length);
      break;
    default :return 0;      //不继续执行
  }

  return  sendedlen;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SwitchID_Server(void)
{
  if(AMP.Time.swicthidtime++>2000) //2秒检查一次拨码
  {
    unsigned  char  tempid  = 0;
    unsigned  char* tempbc  = (unsigned  char*)&AMP.SwData;
    AMP.Time.swicthidtime  = 0;
    tempid  = SWITCHID_ReadLeft(&stSwitch);
    if(*tempbc  != tempid)
    {
      *tempbc  = tempid;
//      AMP01_Configuration();    //重新配置控制板
      SwitchID_Configuration();  
      GenyConfiguration();   //常规接口配置，背光，锁，电源控制    
      COMM_Configuration();
			
			if(AMP.Flag.CabBD)	//柜
			{
				if(AMP.SwData.ID)		//已拨码
					PWM_OUT(TIM2,PWM_OUTChannel1,1,900);						//PWM设定-20161127版本
				else
					PWM_OUT(TIM2,PWM_OUTChannel1,5,900);						//PWM设定-20161127版本
			}
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void LockServer(void)
{
  if(AMP.Flag.CabBD)  //柜控制板
  {
    static unsigned  short locktime = 0;

    if(0  ==  AMP.SwData.ID)    //未拨码--自动开锁
    {
      if(GetLockSts)  //如果锁为关闭状态，则开锁
      {
        UnLock;
      }
      else
      {
        ResLock;
      }
      return;
    }
    if(1==AMP.Req.unlockrun)   //正在执行开锁动作
    {
      if(AMP.Time.LockTime>unlocktime-10)//10ms后开始检查锁状态
      {
        return;
      }
      if(GetLockSts)    //锁未开
      {
        AMP.Sta.lockstd  = 1;
        if(AMP.Time.LockTime==0)//超过开锁时间
        {
          AMP.Req.unlockrun  = 0;
          AMP.Sta.unlockerr  = 1;
          AMP.Time.LockTime   = 0;
          ResLock;
        }
      }
      else
      {
        AMP.Sta.lockstd    = 0;
        AMP.Req.unlockrun  = 0;
        AMP.Sta.unlockerr  = 0;
        AMP.Time.LockTime   = 0;
        ResLock;        
      }      
    }
    if(1==AMP.Req.unlockqust)  //开锁请求
    {
      AMP.Req.unlockrun   = 1;
      AMP.Req.unlockqust  = 0;
      AMP.Req.reslock     = 0;
      AMP.Sta.unlockerr  = 0;
      
      AMP.Req.BLon=1;   //开锁需要开背光
      AMP.Req.PLon=1;   //开锁层板需要供电
      
      AMP.Time.LockTime   = unlocktime;
      UnLock;
    }
    
    //-----------------------------关锁动作
    if(GetLockSts)    //锁未开
    {
      //检查是否为关锁动作
      if(0==AMP.Sta.lockstd)//原状态为锁已打开
      {
        AMP.Req.BLoff = 1;  //请求关背光
        AMP.Req.PLoff = 1;  //请求关闭层板电源
        AMP.Flag.LayPownOn=0; 
      }
      AMP.Sta.lockstd  = 1;
    }
    else
    {
      if(1==AMP.Sta.lockstd) //原状态锁为关闭---手动开锁
      {
        AMP.Req.BLon = 1;  //请求打开背光
        AMP.Req.PLon = 1;  //请求打开层板电源
        AMP.Flag.LayPownOn=1;
      }
      AMP.Sta.lockstd  = 0;
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RequestServer(void)
{
  if(AMP.Flag.CabBD)      //柜控制板
  {
    if(AMP.Req.BLon)      //背光开关控制
    {
      BackLightOn;
      AMP.Req.BLon=0;
    }
    else if(AMP.Req.BLoff)
    {
      BackLightOff;
      AMP.Req.BLoff=0;
    }
    if(AMP.Req.PLon)    //层板供电控制
    {      
      LayPowerOn;
      AMP.Req.PLon=0;
      AMP.Flag.LayPownOn=1;
    }
    else if(AMP.Req.PLoff)
    {
      LayPowerOff;
      AMP.Req.PLoff=0;
      AMP.Flag.LayPownOn=0;
    }
    //if(AMP.Req.unlockqust)
    //{      
      //LockServer();
    //}
    LockServer();
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void StatusServer(void)
{
  static unsigned long statustemp=0;
  unsigned short* ptemp=0;
  ptemp=(unsigned short*)&AMP.Sta;
  if(statustemp!=*ptemp)//状态有变化
  {
    unsigned short framlength=3;
    unsigned char databuffer[32]={0};
    
    stampphydef* ampframe=NULL;
    stcmddef*   Cmd=NULL;
    
