wegam/STM32F1xWorkSpace/Examples/WOW/AMP01.C
    statustemp=*ptemp;
    

    memcpy(databuffer,ptemp,2);
    
    framlength  = PaketUpMsg(databuffer,STA,&framlength);    
    ampframe  = (stampphydef*)databuffer;
    
    ampframe->msg.addr.address1 = AMP.SwData.ID;
    ampframe->msg.addr.address2 = 0;
    ampframe->msg.addr.address3 = 0;
    //-------------------------设置CRC和结束符
    SetCrc(databuffer,&framlength);
    Cabinet_Send(databuffer,framlength);    //往副柜发送消息
  }
}
//=================================硬件接口End=============================================================


//=================================配置函数ST==============================================================

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void COMM_Configuration(void)
{
  if(AMP.Flag.CabBD)  //柜控制板
  {
    //-----------------------------PC接口USART1
    USART_DMA_ConfigurationNR	(USART1,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断
    
    //-----------------------------读卡器接口USART3
    if(0==AMP.SwData.ICreadFlg) //sw2未拨码，默认19200
      USART_DMA_ConfigurationNR	(USART3,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断
    else
      USART_DMA_ConfigurationNR	(USART3,9600,gDatasize);	//USART_DMA配置--查询方式，不开中断

    //-----------------------------层板接口USART2
    stRS485Ly.USARTx  = USART2;
    stRS485Ly.RS485_CTL_PORT  = GPIOA;
    stRS485Ly.RS485_CTL_Pin   = GPIO_Pin_1;
    RS485_DMA_ConfigurationNR			(&stRS485Ly,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
    //-----------------------------副柜接口UART4
    stRS485Cb.USARTx  = UART4;
    stRS485Cb.RS485_CTL_PORT  = GPIOC;
    stRS485Cb.RS485_CTL_Pin   = GPIO_Pin_12;
    RS485_DMA_ConfigurationNR			(&stRS485Cb,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    //-----------------------------层板接口USART1 PA11-RE,PA12-TE
    stRS485Ly.USARTx  = USART1;
    stRS485Ly.RS485_CTL_PORT  = GPIOA;
    stRS485Ly.RS485_CTL_Pin   = GPIO_Pin_12;
    RS485_DMA_ConfigurationNR			(&stRS485Ly,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
    GPIO_Configuration_OPP50	(GPIOA,GPIO_Pin_11);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
    GPIO_ResetBits(GPIOA,GPIO_Pin_11);
  }
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void SwitchID_Configuration(void)
{
  unsigned  char* tempsw = NULL;
  if(AMP.Flag.CabBD)  //柜控制板
  {
    stSwitch.NumOfSW	=	8;
    
    stSwitch.SW1_PORT	=	GPIOC;
    stSwitch.SW1_Pin	=	GPIO_Pin_0;
    
    stSwitch.SW2_PORT	=	GPIOC;
    stSwitch.SW2_Pin	=	GPIO_Pin_1;
    
    stSwitch.SW3_PORT	=	GPIOC;
    stSwitch.SW3_Pin	=	GPIO_Pin_2;
    
    stSwitch.SW4_PORT	=	GPIOC;
    stSwitch.SW4_Pin	=	GPIO_Pin_3;
    
    stSwitch.SW5_PORT	=	GPIOC;
    stSwitch.SW5_Pin	=	GPIO_Pin_4;
    
    stSwitch.SW6_PORT	=	GPIOC;
    stSwitch.SW6_Pin	=	GPIO_Pin_5;
    
    stSwitch.SW7_PORT	=	GPIOC;
    stSwitch.SW7_Pin	=	GPIO_Pin_6;
    
    stSwitch.SW8_PORT	=	GPIOC;
    stSwitch.SW8_Pin	=	GPIO_Pin_7;
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    stSwitch.NumOfSW	=	8;
    
    stSwitch.SW1_PORT	=	GPIOA;
    stSwitch.SW1_Pin	=	GPIO_Pin_7;
    
    stSwitch.SW2_PORT	=	GPIOA;
    stSwitch.SW2_Pin	=	GPIO_Pin_6;
    
    stSwitch.SW3_PORT	=	GPIOA;
    stSwitch.SW3_Pin	=	GPIO_Pin_5;
    
    stSwitch.SW4_PORT	=	GPIOA;
    stSwitch.SW4_Pin	=	GPIO_Pin_4;
    
    stSwitch.SW5_PORT	=	GPIOB;
    stSwitch.SW5_Pin	=	GPIO_Pin_11;
    
    stSwitch.SW6_PORT	=	GPIOB;
    stSwitch.SW6_Pin	=	GPIO_Pin_10;
    
    stSwitch.SW7_PORT	=	GPIOB;
    stSwitch.SW7_Pin	=	GPIO_Pin_2;
    
    stSwitch.SW8_PORT	=	GPIOB;
    stSwitch.SW8_Pin	=	GPIO_Pin_1;
  }
	SwitchIdInitialize(&stSwitch);						//

	
  tempsw  = (unsigned  char*)&AMP.SwData;
  *tempsw  = SWITCHID_ReadLeft(&stSwitch);
  
  if(AMP.Flag.LayBD)//层控制板
  {
    addr2=(SWITCHID_ReadLeft(&stSwitch)>>4)&0X0F;  //层地址
    addr3=SWITCHID_ReadLeft(&stSwitch)&0x0F;  //层地址
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void GenyConfiguration(void)
{
  if(AMP.Flag.CabBD)  //层控制板
  {
    //---------------------锁接口配置
    GPIO_Configuration_OPP50(LockDrPort,LockDrPin);
    GPIO_Configuration_IPU(LockSiPort,LockSiPin);
    ResLock;    //释放锁驱动
    //---------------------背光接口配置
    GPIO_Configuration_OPP50(BackLightPort,BackLightPin);
    BackLightOn;
    //---------------------层板供电接口配置
    GPIO_Configuration_OPP50(LayPowerPort,LayPowerPin);
    LayPowerOn;
  }
  else if(AMP.Flag.LayBD) //柜控制板
  {
    if(addr2&&addr3)
    {
      PWM_OUT(TIM2,PWM_OUTChannel2,1000,1000);						//PWM设定-20161127版本---红色
      PWM_OUT(TIM2,PWM_OUTChannel4,1000,1000);						//PWM设定-20161127版本---黄色
      PWM_OUT(TIM2,PWM_OUTChannel3,1000,1000);						//PWM设定-20161127版本---蓝色
    }
    else
    {
      PWM_OUT(TIM2,PWM_OUTChannel2,2,900);						//PWM设定-20161127版本---红色
      PWM_OUT(TIM2,PWM_OUTChannel4,2,600);						//PWM设定-20161127版本---黄色
      PWM_OUT(TIM2,PWM_OUTChannel3,2,200);						//PWM设定-20161127版本---蓝色
    }
  }
}
//=================================配置函数End=============================================================


//=================================时间函数ST==============================================================

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void Tim_Server(void)
{
	AMP.Time.SYSLEDTime++;
  if(AMP.Flag.CabBD)  //柜控制板
  {
//    AMP.Time.LockTime++;
    //----------------PC发送
    if(AMP.Time.PcSendTime>0)
    {
      AMP.Time.PcSendTime--;
    }
    //----------------柜发送
    if(AMP.Time.CabSendTime>0)
    {
      AMP.Time.CabSendTime--;
    }
    //----------------层发送
    if(AMP.Time.LaySendTime>0)
    {
      AMP.Time.LaySendTime--;
    }
    //----------------读卡器发送
    if(AMP.Time.CardSendTime>0)
    {
      AMP.Time.CardSendTime--;
    }
    //----------------锁
    if(AMP.Time.LockTime>0)
    {
      AMP.Time.LockTime--;
    }
  }
  else if(AMP.Flag.LayBD) //层控制板
  {
    //----------------层发送
    if(AMP.Time.LaySendTime>0)
    {
      AMP.Time.LaySendTime--;
    }
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPdelaymS(unsigned  short time)
{
  SysTick_DeleymS(time);				//SysTick延时nmS
}
#endif
